In [17]:
# basic imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%matplotlib inline

In [18]:
# load dataset
file_path = '../data/raw/sales_data.csv'
df = pd.read_csv(file_path)

df.head()

,date,product,units_sold,unit_price,revenue,leads,mql,sql,opportunities,conversion_rate,cpl,marketing_spend,cac
0,2024-01-01,Leadership Mastery,71,1500,106500,470,220,127,44,1.6136,11.43,5372.98,75.68
1,2024-01-01,High-Performance Communication,94,2500,235000,287,100,44,21,4.4762,9.24,2652.18,28.21
2,2024-01-01,Strategic Thinking,107,3000,321000,613,192,87,30,3.5667,14.69,9007.01,84.18
3,2024-01-01,Executive Presence,41,1500,61500,947,243,135,56,0.7321,9.03,8548.23,208.49
4,2024-01-01,Negotiation for Executives,79,3000,237000,982,379,240,86,0.9186,19.31,18965.52,240.07

In [19]:
# data understanding
print(">>> df.info()")
print("-----------------")
df.info()

print("\n>>> Missing values per column:")
print("-----------------")
print(df.isnull().sum())

print("\n>>> Duplicate rows (count):")
print("-----------------")
print(df.duplicated().sum())

print("\n>>> df.describe():")
print("-----------------")
display(df.describe(include='all').T)

>>> df.info()
-----------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             60 non-null     object
 1   product          60 non-null     object
 2   units_sold       60 non-null     int64
 3   unit_price       60 non-null     int64
 4   revenue          60 non-null     int64
 5   leads            60 non-null     int64
 6   mql              60 non-null     int64
 7   sql              60 non-null     int64
 8   opportunities    60 non-null     int64
 9   conversion_rate  60 non-null     float64
 10  cpl              60 non-null     float64
 11  marketing_spend  60 non-null     float64
 12  cac              60 non-null     float64
dtypes: float64(4), int64(7), object(2)
memory usage: 6.2+ KB

>>> Missing values per column:
-----------------
date               0
product            0
units_sold         0
unit_price         0
revenue            0
leads              0
mql                0
sql                0
opportunities      0
conversion_rate    0
cpl                0
marketing_spend    0
cac                0
dtype: int64

>>> Duplicate rows (count):
-----------------
0

>>> df.describe():
-----------------

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
date,60,12,2024-01-01,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN
product,60,5,Leadership Mastery,12,NaN,NaN,NaN,NaN,NaN,NaN,NaN
units_sold,60.0,NaN,NaN,NaN,65.716667,28.225539,20.0,42.75,66.0,83.0,118.0
unit_price,60.0,NaN,NaN,NaN,2258.333333,592.979168,1500.0,1500.0,2000.0,3000.0,3000.0
revenue,60.0,NaN,NaN,NaN,148691.666667,79068.308361,40500.0,91500.0,127000.0,191875.0,354000.0
leads,60.0,NaN,NaN,NaN,688.466667,286.574951,201.0,400.75,722.0,893.5,1180.0
mql,60.0,NaN,NaN,NaN,275.666667,124.505621,60.0,176.25,246.0,384.25,604.0
sql,60.0,NaN,NaN,NaN,149.05,72.979083,31.0,93.75,136.0,205.25,313.0
opportunities,60.0,NaN,NaN,NaN,66.016667,36.688562,11.0,38.75,56.5,86.25,171.0
conversion_rate,60.0,NaN,NaN,NaN,1.395325,1.197612,0.3017,0.58115,0.92255,1.884225,6.75
cpl,60.0,NaN,NaN,NaN,18.698,6.224641,8.29,13.61,19.275,23.54,29.41
marketing_spend,60.0,NaN,NaN,NaN,12958.1795,7121.200904,2652.18,6051.48,11863.625,19002.8775,33934.79
cac,60.0,NaN,NaN,NaN,254.3975,227.561013,28.21,89.7425,219.645,323.1375,1429.5

In [20]:
# convert date column to datetime
df['date'] = pd.to_datetime(df['date'])

In [21]:
# confirm datetime conversion and time range
print("\n>>> Date range:")
print("-----------------")
print(df['date'].min(), df['date'].max())

df.info()

>>> Date range:
-----------------
2024-01-01 00:00:00 2024-12-01 00:00:00
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   date             60 non-null     datetime64[ns]
 1   product          60 non-null     object
 2   units_sold       60 non-null     int64
 3   unit_price       60 non-null     int64
 4   revenue          60 non-null     int64
 5   leads            60 non-null     int64
 6   mql              60 non-null     int64
 7   sql              60 non-null     int64
 8   opportunities    60 non-null     int64
 9   conversion_rate  60 non-null     float64
 10  cpl              60 non-null     float64
 11  marketing_spend  60 non-null     float64
 12  cac              60 non-null     float64
dtypes: datetime64[ns](1), float64(4), int64(7), object(1)
memory usage: 6.2+ KB

In [23]:
# basic structural exploration

print(">>> Unique products:")
print(df['product'].unique())

print("\n>>> Count of rows per product:")
print(df['product'].value_counts())

print("\n>>> Unique months in dataset:")
print(df['date'].dt.to_period('M').unique())

print("\n>>> Count of rows per month:")
print(df['date'].dt.to_period('M').value_counts().sort_index())

>>> Unique products:
['Leadership Mastery' 'High-Performance Communication'
 'Strategic Thinking' 'Executive Presence' 'Negotiation for Executives']

>>> Count of rows per product:
product
Leadership Mastery                12
High-Performance Communication    12
Strategic Thinking                12
Executive Presence                12
Negotiation for Executives        12
Name: count, dtype: int64

>>> Unique months in dataset:
<PeriodArray>
['2024-01', '2024-02', '2024-03', '2024-04', '2024-05', '2024-06', '2024-07',
 '2024-08', '2024-09', '2024-10', '2024-11', '2024-12']
Length: 12, dtype: period[M]

>>> Count of rows per month:
date
2024-01    5
2024-02    5
2024-03    5
2024-04    5
2024-05    5
2024-06    5
2024-07    5
2024-08    5
2024-09    5
2024-10    5
2024-11    5
2024-12    5
Freq: M, Name: count, dtype: int64

In [27]:
# Basic numeric overview per variable
df.describe().T

,count,mean,min,25%,50%,75%,max,std
date,60,2024-06-16 08:00:00,2024-01-01 00:00:00,2024-03-24 06:00:00,2024-06-16 00:00:00,2024-09-08 12:00:00,2024-12-01 00:00:00,NaN
units_sold,60.0,65.716667,20.0,42.75,66.0,83.0,118.0,28.225539
unit_price,60.0,2258.333333,1500.0,1500.0,2000.0,3000.0,3000.0,592.979168
revenue,60.0,148691.666667,40500.0,91500.0,127000.0,191875.0,354000.0,79068.308361
leads,60.0,688.466667,201.0,400.75,722.0,893.5,1180.0,286.574951
mql,60.0,275.666667,60.0,176.25,246.0,384.25,604.0,124.505621
sql,60.0,149.05,31.0,93.75,136.0,205.25,313.0,72.979083
opportunities,60.0,66.016667,11.0,38.75,56.5,86.25,171.0,36.688562
conversion_rate,60.0,1.395325,0.3017,0.58115,0.92255,1.884225,6.75,1.197612
cpl,60.0,18.698,8.29,13.61,19.275,23.54,29.41,6.224641
marketing_spend,60.0,12958.1795,2652.18,6051.48,11863.625,19002.8775,33934.79,7121.200904
cac,60.0,254.3975,28.21,89.7425,219.645,323.1375,1429.5,227.561013

In [28]:
df.groupby('product')['revenue'].sum().sort_values(ascending=False)

product
Leadership Mastery                2039000
High-Performance Communication    1950000
Strategic Thinking                1841500
Executive Presence                1603500
Negotiation for Executives        1487500
Name: revenue, dtype: int64

In [29]:
df.groupby('product')['revenue'].mean().sort_values(ascending=False)

product
Leadership Mastery                169916.666667
High-Performance Communication    162500.000000
Strategic Thinking                153458.333333
Executive Presence                133625.000000
Negotiation for Executives        123958.333333
Name: revenue, dtype: float64

In [30]:
df.groupby('product')['cac'].mean().sort_values()

product
Leadership Mastery                161.450000
Strategic Thinking                207.885000
Negotiation for Executives        272.816667
Executive Presence                279.307500
High-Performance Communication    350.528333
Name: cac, dtype: float64

In [31]:
funnel_metrics = df.groupby('product')[['leads', 'mql', 'sql', 'opportunities']].mean()
funnel_metrics

,leads,mql,sql,opportunities
product,,,,
Executive Presence,740.500000,284.916667,161.166667,80.166667
High-Performance Communication,736.583333,287.583333,163.916667,72.583333
Leadership Mastery,682.416667,275.083333,150.583333,61.083333
Negotiation for Executives,710.833333,282.166667,143.583333,63.916667
Strategic Thinking,572.000000,248.583333,126.000000,52.333333